Hey @jtdoepke 👋 Thank you for taking the time to raise this, and for opening a pull request to implement it! I'll let the team go through their normal review process, but wanted to mention a workaround in the meantime. Terraform has the capability of loading values for variables by reading environment variables [prefixed with `TF_VAR_name`](https://developer.hashicorp.com/terraform/cli/config/environment-variables#tf_var_name). Leveraging that and [`merge()`](https://developer.hashicorp.com/terraform/language/functions/merge), you can achieve a nearly identical result:

```terraform
provider "aws" {
  default_tags {
    # with merge(), if the same key exists in both maps, the later one takes precedence
    tags = merge(var.default_tags, var.additional_default_tags)
  }
}

variable "default_tags" {
  description = "A map where the key is Environment and the value is the environment. Should be read from the environment and not passed directly."
  type = map
  default = null
}

variable "additional_default_tags" {
  description = "A map of tag names to tag values"
  type = map
  default = null
}

resource "aws_s3_bucket" "test" {
  bucket = "test"
}

output "tags" {
  value = aws_s3_bucket.test.tags_all
}
```

With this `terraform.tfvars`: 

```terraform
additional_default_tags = { Terraform = true, Environment = "prod" }
```

The following output occurs (note the override of `Environment`:

```shell
$ TF_VAR_default_tags='{ Environment = "dev" }' terraform plan
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.test will be created
  + resource "aws_s3_bucket" "test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "prod"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + tags = {
      + Environment = "prod"
      + Terraform   = "true"
    }
```